<a href="https://colab.research.google.com/github/AS-TR0/System-Project/blob/main/AstroPandas3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [3]:
import pandas

In [5]:
PnL = ['Sales','COS','Expenses','Tax']

PnL_DF = pandas.DataFrame(PnL)

In [6]:
PnL_DF

          0
0     Sales
1       COS
2  Expenses
3       Tax

In [11]:
PnL = [['Sales', 1000000,],['COS', 600000,],['Expenses',150000],['Tax',25000]]

PnL_DF = pandas.DataFrame(PnL, columns=['Description', 'Amounts'])

In [12]:
print(PnL_DF)

  Description  Amounts
0       Sales  1000000
1         COS   600000
2    Expenses   150000
3         Tax    25000

In [13]:

financial_data = {
'Year' : [2016, 2017, 2018 , 2019, 2020] ,
'Sales' : [40000,42000, 47000 , 52000, 39000] ,
'Expenses': [30000, 50000,60000,50000, 40000],
'Tax' : [500, 1000, 13000, 100, 90]
}

In [14]:
financial_data_df = pandas.DataFrame(financial_data)

In [15]:
financial_data_df

   Year  Sales  Expenses    Tax
0  2016  40000     30000    500
1  2017  42000     50000   1000
2  2018  47000     60000  13000
3  2019  52000     50000    100
4  2020  39000     40000     90

In [16]:
financial_data_df = pandas.DataFrame(financial_data, index= ['year1', 'year2', 'year3', 'year4', 'year5',])

In [17]:
financial_data_df

       Year  Sales  Expenses    Tax
year1  2016  40000     30000    500
year2  2017  42000     50000   1000
year3  2018  47000     60000  13000
year4  2019  52000     50000    100
year5  2020  39000     40000     90

In [21]:
financial_data_df = pandas.DataFrame(financial_data, index= financial_data['Year'])

In [22]:
financial_data_df

      Year  Sales  Expenses    Tax
2016  2016  40000     30000    500
2017  2017  42000     50000   1000
2018  2018  47000     60000  13000
2019  2019  52000     50000    100
2020  2020  39000     40000     90

In [26]:
financial_data_df = pandas.DataFrame(financial_data, columns=['Sales', 'Expenses', 'Tax'],index= financial_data['Year'])

In [27]:
financial_data_df

      Sales  Expenses    Tax
2016  40000     30000    500
2017  42000     50000   1000
2018  47000     60000  13000
2019  52000     50000    100
2020  39000     40000     90